---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyEnableCuttingInViews
source: html/dc19c5ab-e057-e315-cd75-81b626e0d0dc.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyEnableCuttingInViews Property

"Enable Cutting in Views"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyEnableCuttingInViews { get; }
```